# CitySetIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CitySetIterator Class
Members See Also
---
An iterator to a city set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class CitySetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class CitySetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class CitySetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..CitySetIterator
# See Also
CitySetIterator Members
Autodesk.Revit.DB Namespace